# 09 Membagi Data Frame menjadi dua secara acak

# Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)

print(np.__version__)

1.3.4
1.20.3

# Persiapan Data Frame

In [4]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0   2  12  13   8  15
1   8   5   2   3  16
2   7   4  13  13  17
3  13  14  14   1  16
4  12  15   5  13  15
5   8  10   5   5   3
6   4   8  17  17   6
7   3  17  11  19   4
8  11  12  15  10  12
9  12   1   6  10  18

# Membagi Data Frame menjadi dua secara acak bedasarkan proporsi tertentu

In [5]:
df.shape

(10, 5)

In [8]:
proposi = 0.7
df_1 = df.sample(frac=proposi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape : {df_1.shape}')
print(f'df_2 shape : {df_2.shape}')

df_1 shape : (7, 5)
df_2 shape : (3, 5)

In [9]:
df_1

    A   B   C   D   E
2   7   4  13  13  17
8  11  12  15  10  12
1   8   5   2   3  16
6   4   8  17  17   6
0   2  12  13   8  15
4  12  15   5  13  15
9  12   1   6  10  18

In [10]:
df_2

    A   B   C   D   E
3  13  14  14   1  16
5   8  10   5   5   3
7   3  17  11  19   4